[
    {
        "type": "message",
        "user": "U1KT9ATA5",
        "text": "today is national dog day! (as in woof woof dog not hot dogs lol)",
        "edited": {
            "user": "U1KT9ATA5",
            "ts": "1472222948.000000"
        },
        "ts": "1472217407.000216",
        "reactions": [
            {
                "name": "hotdog",
                "users": [
                    "U1L5GU954",
                    "U1L9DD1NY",
                    "U1L40P4N9",
                    "U1L3PU7BJ"
                ],
                "count": 4
            },
            {
                "name": "dog",
                "users": [
                    "U1KT9ATA5",
                    "U1L9DD1NY"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U1KR9BP0E",
        "text": "Also, National Women's Equality Day! :ok_woman:",
        "ts": "1472218258.000217",
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U1KRZT11T",
                    "U1LJRDPLP",
                    "U1LBRCSEA",
                    "U1KRBJP47",
                    "U1L9DD1NY",
                    "U1KSYP1M5",
                    "U1KRNH021",
                    "U1L7ERY77",
                    "U1L6YQUSU",
                    "U1L40P4N9",
                    "U1KRWUXFU",
                    "U1KT9ATA5",
                    "U1KQGRG2F",
                    "U1MBT6FRB",
                    "U1P8QBBD1",
                    "U1KT3UELS"
                ],
                "count": 16
            },
            {
                "name": "tada",
                "users": [
                    "U1M1L5G6L",
                    "U1LBRCSEA",
                    "U1L5GU954",
                    "U1KRE1L9M",
                    "U1L9DD1NY",
                    "U1KQGRG2F",
                    "U1P8QBBD1"
                ],
                "count": 7
            }
        ]
    },
    {
        "type": "message",
        "user": "U1XCJ1X4H",
        "text": "I just sent out the survey asking you to select your preferred SAS Business Analyst &amp; Predictive Modeler test dates. I sent the survey to your ncsu email. Let me know if you didn't get it.",
        "ts": "1472221201.000218"
    },
    {
        "type": "message",
        "user": "U1KRTHAQZ",
        "text": "Nikki brought cake! It's in the cafeteria. Feel free to help yourself! ",
        "ts": "1472231795.000220"
    },
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "THAT. WAS. DELICIOUS",
        "ts": "1472234551.000221"
    },
    {
        "type": "message",
        "user": "U1LMHQY9E",
        "text": "Thanks <@U1L914KNJ> !",
        "ts": "1472235687.000222"
    },
    {
        "type": "message",
        "user": "U1KRQLFLY",
        "text": "Does anyone know how to turn off the SAS certification email notifications?  I am getting bombarded by acceptance emails... ",
        "ts": "1472239308.000223"
    },
    {
        "type": "message",
        "user": "U1KR9BP0E",
        "text": "In honor of national women's equality day I thought I'd share some good reminders for us all. This is for everyone, not just men- ignore the article title that seems to be pointed towards men. Women can have microaggressions against other women too, I see it all the time. I just think it would be a great opportunity to learn and check it against our own behaviors especially going into practicum, since we come from such a diversity of backgrounds and cultures: <https:\/\/notapattern.net\/2014\/10\/14\/ways-men-in-tech-are-unintentionally-sexist\/>\n\nAnd for women who feel themselves be the target of such microaggressions, here's some things YOU can do to make your workplace culture more positive:\n<http:\/\/www.bustle.com\/articles\/114907-8-ways-you-can-shut-down-sexism-in-the-workplace>\n\nIt would be awesome if we could all read this and encourage each other to be more conscious about how our words and behaviors can impact women around us, both in the workplace and outside of it.",
        "attachments": [
            {
                "service_name": "this is not a pattern",
                "service_url": "http:\/\/notapattern.net",
                "title": "Ways Men In Tech Are Unintentionally Sexist",
                "title_link": "https:\/\/notapattern.net\/2014\/10\/14\/ways-men-in-tech-are-unintentionally-sexist\/",
                "author_name": "Kat Hagan",
                "author_link": "https:\/\/notapattern.net\/author\/codebykat\/",
                "text": "A friend of mine posted this on Twitter:\n\n\nDear lazyweb, looking for blog posts on \"common things men in tech do that are sexist without being intentionally so.\"\n&amp;mdash; Matt Laroche (@mlroach) October 9, 2014\n\nI really respect the amount of self-awareness it takes to ask that question! It&amp;rsquo;s easy to disavow the trolls sending rape and death threats, but&amp;nbsp;it takes much more courage&amp;nbsp;to acknowledge&amp;nbsp;that you might be perpetuating harmful&amp;nbsp;attitudes in less-obvious&amp;nbsp;ways.\n[Author&amp;rsquo;s Note: I felt like it was important to establish some context, but you can also skip the 101-level discussion and jump right&amp;nbsp;to the list.]\nThis question hints at two important concepts:&amp;nbsp;implicit biases and microaggressions.\nWe have all internalized harmful stereotypes about women &amp;mdash; it&amp;rsquo;s part of growing up in a culture that&amp;nbsp;inculcates gender roles from a very early age. Our culture has deeply-embedded patriarchal power structures (ditto racist and classist and ableist and transphobic and homophobic and so on&amp;hellip;) that we all absorb and have to intentionally&amp;nbsp;question and deprogram. We all, regardless of our background or our conscious beliefs, have implicit biases that affect the way we see the world.\n\nGroups that are dominated by one sort of person tend to develop ways of talking and thinking that implicitly center the identities and experiences of that one sort of person, which becomes a self-perpetuating cycle, because it communicates to outsiders that they are different (at best; unwelcome interlopers&amp;nbsp;or second-class citizens, at worst). It can introduce, or exacerbate, the further self-fulfilling prophecies of impostor syndrome and&amp;nbsp;stereotype threat. It can put pressure on people to&amp;nbsp;conform to a certain type in order to succeed.\nThis context is the heart of why inclusive language matters, why a seemingly-harmless joke isn&amp;rsquo;t that harmless, and why small things seem to sometimes get blown out of proportion.\nWhich brings us to&amp;nbsp;microaggressions: &amp;ldquo;social exchanges in which a member of a dominant culture says or does something, often accidentally, and without intended malice, that belittles and alienates a member of a marginalized group.&amp;rdquo;\nThese are little things. Things that many people do without thinking about them and certainly without intending anything by them. Things that individually are meaningless, but in aggregate set the tone of an entire community.\nLittle things reinforce stereotypes and implicit biases instead of challenging them. They insulate members of the dominant group from having to confront their own biases. They communicate underlying attitudes and community norms. Language may or may not shape the way we think, but it is a powerful signal about what sort of behavior is and is not acceptable, and what your personal expectations are.\nWorse, those little things can subtly reinforce the attitudes of actual abusers and signal that they are welcome in our community. (Example: rape jokes are seen as tacit nods of approval by actual rapists.)\nCommunication is tricky even on the best of days; the best defense against misunderstandings is to develop a finely-tuned sense of empathy, and try to notice as much as possible what we&amp;rsquo;re doing that might create distance from someone else&amp;nbsp;and keep&amp;nbsp;us from questioning our own assumptions about the world.\nSometimes it&amp;rsquo;s hard to see these things without getting defensive, or going too far down the road of guilt and excessive self-flagellation. I think it&amp;rsquo;s important to realize that&amp;nbsp;every single one of us&amp;nbsp;makes this kind of mistake, no one is immune. The determination of character, in my opinion, isn&amp;rsquo;t whether you slip up, but what you do about it afterward.\nIf you care about others, nothing feels worse than realizing you accidentally&amp;nbsp;stepped on someone else&amp;rsquo;s foot.&amp;nbsp;I really think it&amp;rsquo;s a natural reaction to bristle a bit, to try to minimize it, to protect ourselves from feeling bad. Once I recognized that defensiveness as a natural part of the process, it was much easier for me to realize I was doing&amp;nbsp;it, then apologize and move on instead of digging myself deeper. It takes practice.\nThe good news, though, is that&amp;nbsp;little things are easy to change. Personally I believe that if you can change the outward tone of a culture, you stand a good chance of changing the actual beliefs and attitudes of that culture.\nCaveats: not everyone notices or cares about every single thing on this list, and I&amp;rsquo;ve probably missed some that my own privilege blinds me to. This&amp;nbsp;is&amp;nbsp;a list specifically focused on sexist microaggressions;&amp;nbsp;while some of the things on this list might also apply to, for instance, transfolk or non-binary folks or people of color, I can&amp;rsquo;t claim to speak for anyone other than myself.\nThe post is written as &amp;ldquo;things men do&amp;rdquo;, because that&amp;rsquo;s the question that was asked, but&amp;nbsp;of course anyone can (and does) perpetuate harmful stereotypes.\nFinally, this list is written for those who, like me, try to err on the side of being maximally-inclusive. Many of these things are common in our culture, and while I try to model good behavior, I&amp;nbsp;don&amp;rsquo;t correct others&amp;rsquo; usage unless they ask. I consider this an application of the robustness principle.\nSo,&amp;nbsp;without further ado.\n1. Using &amp;ldquo;guys&amp;rdquo; to mean&amp;nbsp;&amp;ldquo;people&amp;rdquo;.\nI fear I&amp;rsquo;m earning&amp;nbsp;a bit of a reputation for this one among my colleagues, as I sometimes&amp;nbsp;good-naturedly respond to &amp;ldquo;Hey guys, ?&amp;rdquo; with &amp;ldquo;I&amp;rsquo;m not a guy, but &amp;rdquo;. Yes, most people intend this in a gender-neutral way; no, it is not actually gender-neutral. If you think about it, &amp;ldquo;guys&amp;rdquo; is only gender-neutral in a situation where maleness is the assumed default.\nMany women don&amp;rsquo;t notice or mind this, but to some in our male-dominated field it can be a tiny, pointed reminder of the extra work they have to do just to fit in, be seen, be taken seriously.\nPersonally, it can also&amp;nbsp;make me wonder if&amp;nbsp;I&amp;rsquo;m being seen at all; I often read&amp;nbsp;a message to a mailing list, or in a chat room, that begins &amp;ldquo;hey guys&amp;rdquo; and wonder whether the speaker realizes that not everyone on the list is a man. Worse, I worry it sends the wrong message to other women who might observe the exchange. For instance, if a woman was thinking of getting&amp;nbsp;involved in&amp;nbsp;WordPress development, could all the &amp;ldquo;guys&amp;rdquo; messages on the wp-hackers list make her think there aren&amp;rsquo;t any women in that community?\nDon&amp;rsquo;t do the &amp;ldquo;guys and girls&amp;rdquo; thing either, which is marginally better but still makes it feel like an afterthought. Try: &amp;ldquo;folks&amp;rdquo;, &amp;ldquo;y&amp;rsquo;all&amp;rdquo;, &amp;ldquo;everyone&amp;rdquo;, &amp;ldquo;team&amp;rdquo;, &amp;ldquo;channel&amp;rdquo;, or just &amp;ldquo;awesome people&amp;rdquo;.&amp;#128578; If my own experience is any indication, it&amp;rsquo;ll sound weird for a month or two and then become normal.\nRelatedly, avoid assuming male users&amp;nbsp;in your documentation. Just stop worrying and embrace the singular &amp;ldquo;they&amp;rdquo;.\n2. Similarly: &amp;ldquo;girls&amp;rdquo; for &amp;ldquo;women&amp;rdquo;.\nYes, I know it&amp;rsquo;s the best we have as an informal analogue to &amp;ldquo;guys&amp;rdquo;, but it infantilizes women and sounds patronizing. It might subconsciously encourage us to take women less seriously. In general, &amp;ldquo;girl&amp;rdquo; should be used to refer to female children only. Like &amp;ldquo;guys&amp…",
                "fallback": "this is not a pattern Link: Ways Men In Tech Are Unintentionally&nbsp;Sexist",
                "from_url": "https:\/\/notapattern.net\/2014\/10\/14\/ways-men-in-tech-are-unintentionally-sexist\/",
                "service_icon": "https:\/\/s0.wp.com\/i\/webclip.png",
                "id": 1
            }
        ],
        "edited": {
            "user": "U1KR9BP0E",
            "ts": "1472239783.000000"
        },
        "ts": "1472239512.000224",
        "reactions": [
            {
                "name": "clap",
                "users": [
                    "U1P8QBBD1",
                    "U1KRBFY3Z",
                    "U1KT3UELS",
                    "U1KSYP1M5",
                    "U1LJRDPLP",
                    "U1L3K1AKD",
                    "U1L1D4WG7",
                    "U1KS1BFED",
                    "U1L914KNJ",
                    "U1KRBJP47",
                    "U1L3G0YRJ",
                    "U1M1L5G6L",
                    "U1KR80QMS",
                    "U1L974M70",
                    "U1KSPCE87"
                ],
                "count": 15
            },
            {
                "name": "heart",
                "users": [
                    "U1MBT6FRB"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "<@U1KRQLFLY> in your notification settings for the calendar, there's one that says \"Receive an update when guests respond to an event for which you can see the guest list.\"",
        "ts": "1472240399.000229"
    },
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "my guess is you have that checked",
        "ts": "1472240407.000230"
    },
    {
        "type": "message",
        "user": "U1KRQLFLY",
        "text": "Thanks <@U1KQYG6SJ>",
        "ts": "1472240574.000231"
    },
    {
        "type": "message",
        "user": "U1N43E3E0",
        "text": "I don't know if I'm the only one, but I personally struggled to wrap my mind around the concept of the unit vector in Dr Race's review (question 11).  This khan academy series really helped me, and I hope this helps other people as well.  From here you can sort of imagine\/extend the same principle to n sized vectors where you just have to divide each individual scalar in the vector by the  vector's euclidean norm to find out what the unit vector is that runs in the same direction. \n\n<https:\/\/www.khanacademy.org\/math\/precalculus\/vectors-precalc\/unit-vectors\/v\/unit-vector-intro>",
        "ts": "1472250431.000232",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U1NUU2U9E",
                    "U1KSBCBFG",
                    "U1KSL7C10",
                    "U1L974M70"
                ],
                "count": 4
            }
        ]
    }
]