[
    {
        "type": "message",
        "user": "U1KR9BP0E",
        "text": "<@U1L3G0YRJ> I know that scarf belongs to <@U1KS1BFED>",
        "ts": "1477837518.000620"
    },
    {
        "type": "message",
        "user": "U1MH8UXHD",
        "text": "My vest!! Thank you <@U1L3G0YRJ> !!",
        "ts": "1477837988.000621"
    },
    {
        "type": "message",
        "user": "U1L1D4WG7",
        "text": "Cool telescope stargazing event coming up on the 19th. My family will be there!\n<https:\/\/www.eventbrite.com\/e\/explore-dorothea-dix-park-skywatching-tickets-28013102945>",
        "attachments": [
            {
                "service_name": "Eventbrite",
                "title": "Explore Dorothea Dix Park - Skywatching!",
                "title_link": "https:\/\/www.eventbrite.com\/e\/explore-dorothea-dix-park-skywatching-tickets-28013102945",
                "text": "Join staff and volunteers from the Morehead Planetarium and Science Center for a free skywatching program at Dorothea Dix Park!  Telescopes will be set up to view stars and the moon.  Look up at the night sky as educators guide you through fun observations of stars, planets, moons, nebulae and other celestial objects!DetailsThis is an informal session, so you can arrive and leave any time during the two hours of the program. However, if you plan to attend, please register so that we can send you any additional information you may need as we get closer to the date.All ages are welcome. Very young children may not get much out of looking through a telescope, but those elementary-school-aged and older may especially enjoy the experience. Parents: We recommend you look through the telescope first—then you’ll be better able to help your child look.Sometimes, children (as well as adults) want to grab hold of the telescope, potentially smudging the eyepiece or knocking the object out of view. Please teach children not to touch the telescope without the operator’s permission. You can ask children to place their hands behind their back as they approach the scope. Explain they’ll be using their eyes to look, not their <http:\/\/hands.Be|hands.Be> sure to dress in layers.  There are no shelters at the skywatching location and the wind can be chilly.Please leave all pets at home, even those on a leash. Darkness, lots of people, expensive telescopes and pets on leashes is a bad combination.  For more FAQ's, please visit: <http:\/\/moreheadplanetarium.org\/programs\/teen-adult-programs\/skywatching\/skywatching-faqLocation> and ParkingThe skywatching session will be located at Dorothea Dix Park on the Big Field.  This is bordered by Blair Drive, Barbour Drive and Biggs Drive.Parking is available in gravel lots on Biggs Drive (please do not park on grass under the trees) and at the Adams Building Lot, located roughly at 101 Blair Drive.Please be courteous when driving in and try not to have your headlights light up the field more than necessary.Please bring a small flashlight to help you walk across the field, but you might find that avoiding all light and letting your eyes adjust to the darkness is more beneficial.  Even a little light can throw off your night vision.Please Note: There are no bathrooms in the park and no drinkable water, so please plan to bring a water bottle and come prepared to only have portajohns available, which are a significant walk from the skywatching site. Walking in grass and up and down hills may be necessary.Liability WaiverCity of Raleigh - Parks, Recreation and Cultural Resources DepartmentRelease, Covenant Not To Sue, and Indemnity Agreement I understand that participating in Discover Dorothea Dix Park – Program (hereinafter “Program”) involves risk of injury. These risks include, but are not limited to, inclement weather, accidents while traveling, equipment problems or failures, contacts with and actions of other participants, spectators, or volunteers, slips\/trips\/falls, and musculoskeletal injuries, among others. I choose for myself, for my child, or for another participant who I am enrolling, to participate in the Program despite these and other risks. Pictures or video may be taken of participant for use in program publicity. My email will also be used to keep me informed of Dorothea Dix Park communications. By signing this form, I acknowledge all risks of injury, illness, and death, and property damage, and affirm that I have assumed all responsibility of injury, illness, death, and property damage relating in any way to the Program.  I also agree for myself and for any child or other participant who I am registering herein to follow all rules and procedures that may apply to the Program and to follow the reasonable instructions of City employees and other supervisors of the Program.  In return for the opportunity to participate in this Program, I agree for myself and for the child or other participant I am registering, and for our heirs, assigns, executors, and administrators to release, waive, and discharge any legal rights that any one of us may have to seek payment or relief of any kind from the City of Raleigh, the North Carolina Department of Health and Human Services, and the State of North Carolina, their employees or their agents for injury, illness, or death relating in any way to this Program.  If I am registering a minor for the Program, I agree that I am a parent, legal guardian, or am otherwise responsible for the minor whose application I am submitting and that I release, waive, and discharge any legal rights on behalf of that minor. If I am registering an adult, I agree that I am authorized to do so and do hereby release, waive, and discharge any legal rights on behalf of that adult participant.  I, along with any participant I register herein, also agree not to sue the City of Raleigh, the North Carolina Department of Health and Human Services, or the State of North Carolina, their employees, or their agents and agree to indemnify the same for any and all claims, damages, losses or expenses, including but not limited to medical expenses and attorney’s fees, if a suit is filed concerning an injury (to person or property), illness, or death to me or to any participant I am enrolling that relates to, or results from, participation in the Program. I have read this document thoroughly and understand that by registering for this program I am waiving legal rights.",
                "fallback": "Eventbrite: Explore Dorothea Dix Park - Skywatching!",
                "image_url": "https:\/\/img.evbuc.com\/https%3A%2F%2Fcdn.evbuc.com%2Fimages%2F24421182%2F171338356275%2F1%2Foriginal.jpg?w=1000&rect=0%2C37%2C2724%2C1362&s=42828370d50b8ea0eb1884101bda4196",
                "fields": [
                    {
                        "title": "Where",
                        "value": "102 Blair Drive, Raleigh, NC",
                        "short": true
                    },
                    {
                        "title": "When",
                        "value": "Sat, Nov 19, 2016 at 6:30 PM",
                        "short": true
                    }
                ],
                "from_url": "https:\/\/www.eventbrite.com\/e\/explore-dorothea-dix-park-skywatching-tickets-28013102945",
                "image_width": 500,
                "image_height": 250,
                "image_bytes": 419199,
                "service_icon": "https:\/\/cdn.evbstatic.com\/s3-build\/perm_001\/1aab42\/django\/images\/touch_icons\/apple-touch-icon-57x57.png",
                "id": 1
            }
        ],
        "ts": "1477866415.000622"
    },
    {
        "type": "message",
        "user": "U1L6WB44A",
        "text": "Hi all! One of my favorite holiday traditions is volunteering at The Salvation Army's Angel Tree! Robin and I are going to be signing up for shifts on November 19th at Cary Towne Center, and it's always a ton of fun to help people pick out angels and accept toys for angels they're already picked out! If you have a free weekend or evening, or want to do it on the 19th with us, you can sign up online: <https:\/\/www.salvationarmycarolinas.org\/wakecounty\/get-involved\/christmas-opportunities\/angel-tree-opportunities>",
        "ts": "1477867142.000624",
        "reactions": [
            {
                "name": "heart",
                "users": [
                    "U1KT3UELS",
                    "U1L0RBZFH"
                ],
                "count": 2
            }
        ]
    },
    {
        "type": "message",
        "user": "U1L0RBZFH",
        "text": "<@U1L6WB44A> Which shift are you signing up for?",
        "ts": "1477872355.000625"
    },
    {
        "type": "message",
        "user": "U1L6WB44A",
        "text": "We're signed up for 12-2, but I'll hang out all day if other people are there! ",
        "ts": "1477872589.000626"
    },
    {
        "type": "message",
        "user": "U1L0RBZFH",
        "text": "sounds good!",
        "ts": "1477873514.000627"
    },
    {
        "type": "message",
        "user": "U1KRWUXFU",
        "text": "<@U1L6WB44A>: I'm in! ",
        "ts": "1477875636.000628"
    },
    {
        "type": "message",
        "user": "U1L0RBZFH",
        "text": "<@U1KRWUXFU> I signed up for 2-4pm on the 19th if you want to do it together :two_women_holding_hands:",
        "ts": "1477876324.000629"
    }
]