[
    {
        "type": "message",
        "user": "U1L7ERY77",
        "text": "anyone have experience with open source databases like postgresql or setting up a database for their practicum?  Our data is too large to work with in R and we need a way to store our data and efficiently pull in only what we need into R, which is why I'm setting up a postgresql database.  How are other people dealing with their large data using open source tools?",
        "ts": "1476634808.000022"
    },
    {
        "type": "message",
        "user": "U1N43E3E0",
        "text": "Have you explored the idea of using MySQL?  It's open source.  There might be other options out there as my understanding is the real advantage of MySQL is how well it integrates with web applications, but it's also a very popular DBMS so there's a lot of resources you can find online.",
        "ts": "1476635146.000023"
    },
    {
        "type": "message",
        "user": "U1KS4UE2F",
        "text": "mysql is on the practicum server i believe",
        "ts": "1476635370.000024"
    },
    {
        "type": "message",
        "user": "U1KRNTXL5",
        "text": "A couple questions for y'all:  - has John said anything about how\/where to back up our files on the server?  and is it possible to transfer files from our laptop to the server?  Like code snippets.",
        "ts": "1476657760.000025"
    },
    {
        "type": "message",
        "user": "U1KRTHAQZ",
        "text": "So the server has a back up drive that you can use but I haven't heard of any specific instructions regarding how to back up files ",
        "ts": "1476664467.000026"
    },
    {
        "type": "message",
        "user": "U1KRTHAQZ",
        "text": "I asked John about transferring files from our laptop to the server. We have some documents on Google drive that we wanna transfer over and he said that's fine (since drive is pretty secure) but he told us not to make a habit out of it. I think he may give us more information on how exactly he wants us to transfer files (and back up files for that matter)",
        "ts": "1476664645.000027"
    },
    {
        "type": "message",
        "user": "U1KRB11QC",
        "text": "<@U1KRNTXL5> <@U1KRTHAQZ> In regards to back up, I am just copying everything in the working HDD-Data drive into the Backup drive every other night\/few nights until we get clearer instructions. It would be nice if we could automate this",
        "ts": "1476664715.000028"
    },
    {
        "type": "message",
        "user": "U1KRTHAQZ",
        "text": "<@U1KRB11QC> Yep that's what I'm doing as well. Yeah I'm hoping there's a way to schedule nightly backups automatically",
        "ts": "1476664815.000029"
    },
    {
        "type": "message",
        "user": "U1N43E3E0",
        "text": "<https:\/\/technet.microsoft.com\/en-us\/library\/cc731517(v=ws.11).aspx>",
        "ts": "1476664913.000030"
    },
    {
        "type": "message",
        "user": "U1KRB11QC",
        "text": "Thank you <@U1N43E3E0>",
        "ts": "1476665375.000031",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U1N43E3E0"
                ],
                "count": 1
            }
        ]
    }
]