[
    {
        "type": "message",
        "user": "U1L9DD1NY",
        "text": "I have room for one more spot if someone else needs a ride! :slightly_smiling_face:",
        "ts": "1475584758.000799"
    },
    {
        "type": "message",
        "user": "U1L0V1X61",
        "text": "Ginger spice chai in the kitchen. Get it while it lasts!",
        "ts": "1475585671.000800"
    },
    {
        "type": "message",
        "user": "U1KR9BP0E",
        "text": "Does anyone remember the correct settings for getting a PDF in the right direction into OneNote?",
        "edited": {
            "user": "U1KR9BP0E",
            "ts": "1475586293.000000"
        },
        "ts": "1475586282.000801"
    },
    {
        "type": "message",
        "user": "U1KR9BP0E",
        "text": "nvm got it!",
        "ts": "1475586390.000803"
    },
    {
        "type": "message",
        "user": "U1LMHQY9E",
        "text": "anybody need a ride and\/or wanna grab lunch on the way to sas and\/or pick up a parking pass on the way",
        "ts": "1475595444.000804"
    },
    {
        "type": "message",
        "user": "U1KSH8676",
        "text": "Hey everyone please take a moment of your time to read this and please donate if you can! Thanks!\n\nPOTS is the most common disease you've probably never heard of. Standing for Postural Orthostatic Tachycardia Syndrome, POTS is an invisible illness affecting all of the \"automatic\" functions of the body (i.e. heart rate, blood pressure, temperature). \n\nMy sister Paige was diagnosed with POTS in 2011 - after a year of countless doctors appointments in search for an answer. It's a debilitating disease that completely changed her life and many others. She went from a normal college student to someone who couldn't stand long enough to brush her teeth. \n\nShe's one of the very lucky patients in which her symptoms have improved over time. She is so fortunate for her health, but there are millions of people suffering from this currently incurable disease. Men and women are in wheelchairs, have feeding tubes, and are unable to work because of this illness. \n\nDonating to Dysautonomia International will get us closer to a cure for POTS! A small donation would be greatly appreciated, as further research will impact millions. Thank you :)\n\n<https:\/\/www.crowdrise.com\/charlotte-nc-dysautonomia-awareness-celebration\/fundraiser\/dysautonomiaawareness>\n\nThank you! And please forward on the link to family \/ friends.  \n\nAnd if you have any questions please let me know!\n",
        "attachments": [
            {
                "service_name": "Crowdrise",
                "title": "Charlotte Dysautonomia Awareness Celebration! | Dysautonomia Awareness' Fundraiser",
                "title_link": "https:\/\/www.crowdrise.com\/charlotte-nc-dysautonomia-awareness-celebration\/fundraiser\/dysautonomiaawareness",
                "text": "We're lighting up the Wells Fargo Duke Energy Center turquoise for Dysautonomia Awareness Month and throwing a party! #MakeNoiseForTurquoise",
                "fallback": "Crowdrise: Charlotte Dysautonomia Awareness Celebration! | Dysautonomia Awareness' Fundraiser",
                "image_url": "https:\/\/www.crowdrise.com\/media\/original\/user_photo-57eb37788d7c9.jpg",
                "from_url": "https:\/\/www.crowdrise.com\/charlotte-nc-dysautonomia-awareness-celebration\/fundraiser\/dysautonomiaawareness",
                "image_width": 188,
                "image_height": 250,
                "image_bytes": 282762,
                "service_icon": "https:\/\/www.crowdrise.com\/apple-touch-icon-152x152-precomposed.png",
                "id": 1
            }
        ],
        "ts": "1475617576.000807",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U1LMHQY9E",
                    "U1P8QBBD1",
                    "U1KSGHLPJ",
                    "U1L46HXCJ",
                    "U1L914KNJ",
                    "U1NUU2U9E",
                    "U1KSL7L7R",
                    "U1N43E3E0"
                ],
                "count": 8
            }
        ]
    },
    {
        "type": "message",
        "user": "U1KT3UELS",
        "text": "Pro tip: learned from the Internet that if your pc is updating slow or stalling with updates, just pull out any usb connections (like a wireless mouse) and it'll go a million times faster! ",
        "ts": "1475620996.000809",
        "reactions": [
            {
                "name": "+1",
                "users": [
                    "U1L6YQUSU",
                    "U1KSL7L7R",
                    "U1KRB11QC",
                    "U1L9DD1NY",
                    "U1L735VD4",
                    "U1L7ERY77",
                    "U1L7E8GSU",
                    "U1LMHQY9E",
                    "U1NUU2U9E"
                ],
                "count": 9
            }
        ]
    },
    {
        "type": "message",
        "user": "U1KRNTXL5",
        "text": "Since we were encouraged to reach out to folks by LinkedIn...   Does anyone know if we should mark non-IAA alums as \"colleagues\"?  If you mark Other it asks for an email address.",
        "ts": "1475634618.000810"
    },
    {
        "type": "message",
        "user": "U1L6YQUSU",
        "text": "I always put \"done business with\" and then chosen the IAA.  Works every time ",
        "ts": "1475634665.000811"
    },
    {
        "type": "message",
        "user": "U1L914KNJ",
        "text": "April said that linkedin doesn't show the 'how you know them' to the person you request, so apparently you don't have to worry about it. I have been saying that I know them as a classmate at NC State (should Linkedin ever expose this information it would be close to accurate). - or like John said. April did say not to use 'Friend' though. She said that there is some limit on the number of 'friends' you can request on linkedin.",
        "ts": "1475634708.000812"
    }
]