[
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "<https:\/\/www.amazon.com\/Future-Essentials-Organic-Dehydrated-Water\/dp\/B00BQ1VD6W\/ref=redir_mobile_desktop?ie=UTF8&amp;ref_=cm_cr_arp_mb_bdcrb_top> :smile:",
        "ts": "1474475809.000176"
    },
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "the comments are golden",
        "ts": "1474475816.000177",
        "reactions": [
            {
                "name": "joy",
                "users": [
                    "U1L1D4WG7"
                ],
                "count": 1
            }
        ]
    },
    {
        "type": "message",
        "user": "U1L1D4WG7",
        "text": "some more beauties\n<http:\/\/bgr.com\/2015\/10\/12\/amazon-product-reviews-best-funny\/>",
        "attachments": [
            {
                "service_name": "BGR",
                "service_url": "http:\/\/bgr.com",
                "title": "The funniest Amazon product reviews you’ve ever seen",
                "title_link": "http:\/\/bgr.com\/2015\/10\/12\/amazon-product-reviews-best-funny\/",
                "author_name": "Yoni Heisler",
                "author_link": "https:\/\/bgr.com\/author\/yheisler2\/",
                "thumb_url": "https:\/\/i1.wp.com\/boygeniusreport.files.wordpress.com\/2015\/10\/amazon-jeff-bezos.jpg?fit=200%2C150&quality=98&strip=all&ssl=1",
                "thumb_width": 200,
                "thumb_height": 142,
                "text": "With hundreds of millions of items for sale, from electronics and books to pet supplies and diapers, Amazon is unquestionably the largest online retailer on the planet. In fact, Amazon, from a market cap perspective, is even larger today than Walmart.\nOne of the reasons why Amazon is such a popular online destination is that many products are accompanied&amp;nbsp;by hundreds, and sometimes thousands, of product reviews from everyday consumers who can speak with first-hand authority to the merits of whatever item is being considered. As a result, consumers are able to&amp;nbsp;make more informed shopping decisions and steer clear of items they might ultimately&amp;nbsp;regret purchasing. Of course, with the Internet being what it is, Amazon&amp;rsquo;s vast library of product reviews are also filled with a good number of&amp;nbsp; sarcastic, biting, clever, and downright hilarious responses. Some even speculate that these reviews may be responsible for Amazon CEO Jeff Bezos&amp;rsquo; distinctive laugh.\nSo without further ado, listed below are some of the best and funniest Amazon product reviews we could find.&amp;nbsp;Buckle up, these are pretty golden.\n\nDON&amp;rsquo;T MISS:&amp;nbsp;Meet Bird, a device that could find itself at the center of your connected future\nBanana Slicer\n\nThis banana slicer is actually one of the more widely known products brimming with over the top and sarcastic reviews. While its very existence is certainly&amp;nbsp;bound to&amp;nbsp;raise a few eyebrows,&amp;nbsp;5,296 customers gave this an average rating of 4.5 stars. Still, it&amp;rsquo;s not as if the banana slicer is not without its fair share of controversy.\nOn&amp;nbsp;one hand, the banana slicer might be able to salvage a dying relationship.\n\nBut on the other hand, the banana slicer does suffer from a glaring industrial design flaw.\n\nClearly, we need a tie-breaker to see if this product is worth the $3.80 asking price.\n\nJL421 Badonkadonk Land Cruiser\/Tank&amp;nbsp;\n\nBelieve it or not, but you can purchase a personal tank style cruiser on Amazon for just 19 grand. Not surprisingly, this product elicited a number of hilarious reviews, though this one in particular really stands out.\nI&amp;rsquo;ll admit it. Shopping for a personal tank can be a bit daunting. Many times in the past I&amp;rsquo;ve purchased overpriced, so-called &amp;ldquo;battle tanks&amp;rdquo;, then driven them into battle only to be wrecked in ten minutes by the first blow off of some insurgents home-made morter.\nBut not this baby, no way.\nThis tank R-O-C-K-S! Literally- the 400-watt sound-system keeps me rockin like a crazy man as I&amp;rsquo;m dishing out justice commando style. Wow. I just can&amp;rsquo;t say enough. And the kids love it, too- imagine the look of terror in the eyes of the enemy as I&amp;rsquo;m dropping off my kid&amp;rsquo;s team to their soccer game. Shock and awe, my friends, SHOCK AND AWE!\nI had NAO install the optional GPS-guided white phosphorus missile system, and talk about *SWEET*! Burn baby burn!!!\nOh, it also has plenty of room for groceries, and if you need to like move a loveseat or something it&amp;rsquo;ll fit if you use a little bungee cord.\nThe only real negative with this tank is that it shows up on radar a little more than I like (although there is a polyresin graphite stealth model available). Also, the included spare isn&amp;rsquo;t full size.\nOverall, a great tank.\nTuscan Whole Milk, 1 Gallon\n\nOne of the more famous Amazon products to receive an onslaught of hilarious reviews is this gallon of Tuscan Whole Milk. In fact, the initial spate of sarcastic reviews that accompanied this product listing became so well-known that it even became the topic of a 2006 New York Times article.\nSome of the funnier reviews are below.\n\n\nThree Wolf Moon Short Sleeve Tee&amp;nbsp;\n\nIt&amp;rsquo;s been a while, but you might remember that this ridiculous wolf-themed T-shirt became an ironic best-seller on Amazon back in 2009, paving the way for countless product reviews. I mean, it&amp;rsquo;s not every day that a t-shirt warrants its own Wikipedia page. &amp;nbsp;With so&amp;nbsp;many great reviews to choose from, it was almost impossible to narrow things down to just one representative example. That said, this one here, which was one of the first to grace the product&amp;rsquo;s Amazon page, might just do the trick.\nThis item has wolves on it which makes it intrinsically sweet and worth 5 stars by itself, but once I tried it on, that&amp;rsquo;s when the magic happened. After checking to ensure that the shirt would properly cover my girth, I walked from my trailer to Wal-mart with the shirt on and was immediately approached by women. The women knew from the wolves on my shirt that I, like a wolf, am a mysterious loner who knows how to &amp;lsquo;howl at the moon&amp;rsquo; from time to time (if you catch my drift!). The women that approached me wanted to know if I would be their boyfriend and\/or give them money for something they called mehth. I told them no, because they didn&amp;rsquo;t have enough teeth, and frankly a man with a wolf-shirt shouldn&amp;rsquo;t settle for the first thing that comes to him.\nI arrived at Wal-mart, mounted my courtesy-scooter (walking is such a drag!) sitting side saddle so that my wolves would show. While I was browsing tube socks, I could hear aroused asthmatic breathing behind me. I turned around to see a slightly sweaty dream in sweatpants and flip-flops standing there. She told me she liked the wolves on my shirt, I told her I wanted to howl at her moon. She offered me a swig from her mountain dew, and I drove my scooter, with her shuffling along side out the door and into the rest of our lives. Thank you wolf shirt.\nPros: Fits my girthy frame, has wolves on it, attracts women\nCons: Only 3 wolves (could probably use a few more on the &amp;lsquo;guns&amp;rsquo;), cannot see wolves when sitting with arms crossed, wolves would have been better if they glowed in the dark.\nSigma Ultra-Telephoto Zoom Lens\n\nLooking to bolster the capabilities of your Canon DSLR? Have $25,000 lying around? Then perhaps you might be interested in this Sigma Ultra-Telephoto Zoom Lens tailor made for&amp;nbsp;Canon DSLR cameras. These folks, after all, seemed to enjoy it.\n\n\nMicrowave for One\n\nThis 1987 classic is a must-have for anyone wanting to be taken seriously in the kitchen. As you might expect, there are so many hilarious reviews for this title that we&amp;rsquo;d be doing you all a huge disservice by not posting quite a few examples. Below are a few of the better games we came across.\n\n\nHorse Head Mask\n\nWhat wardrobe is complete without a horse head mask? With Halloween coming up, who knows, this might be the perfect gift for any Bojack Horseman fans you might know. Or, just as easily, get this bad boy for yourself and gleefully scare friends and loved ones alike. Interestingly enough, the top rated comment for this product comes from none other than George Takei. Still, we thought these ones were a tad more worthy of a mention.\n\nFramed Samsung&amp;nbsp;85-Inch 4K Ultra HD&amp;nbsp;\n\n4K HDTVs may be getting cheaper, but this framed 85-inch behemoth from Samsung &amp;mdash; originally priced at $45,000 &amp;mdash; &amp;nbsp;is certainly an exception to the rule.\n\nHow to Avoid Huge Ships\n\nThis book sounds like a maritime thriller, but unfortunately the reviews indicate otherwise.\n\nSteering Wheel Attachable Work Surface Tray&amp;nbsp;\n\n&amp;nbsp;\nHopefully Tesla or some other forward-thinking car manufacturer will soon start making these steering wheel compatible work trays standard. Just look at how productive it might make the morning commute for millions of people across the globe.\n\n\nDefense Technology Pepper Spray&amp;nbsp;\nOne review reads:\nI casually used this product to try to disperse a small band of non-violent campers who had locked their arms together. Although initially it seemed to be effective, it took two applications! The worst part is that th…",
                "fallback": "BGR Link: The funniest Amazon product reviews you&#8217;ve ever seen",
                "from_url": "http:\/\/bgr.com\/2015\/10\/12\/amazon-product-reviews-best-funny\/",
                "service_icon": "http:\/\/0.gravatar.com\/blavatar\/616256b50efddd8ae9b0c7f1f339a9f5?s=114",
                "id": 1
            }
        ],
        "ts": "1474476840.000178",
        "reactions": [
            {
                "name": "joy",
                "users": [
                    "U1NUU2U9E",
                    "U1KRWUXFU",
                    "U1L3G0YRJ"
                ],
                "count": 3
            }
        ]
    },
    {
        "type": "message",
        "user": "U1NUU2U9E",
        "text": "<@U1L1D4WG7> this is hilarious!",
        "ts": "1474493633.000184"
    },
    {
        "type": "message",
        "user": "U1L1D4WG7",
        "text": "<@U1NUU2U9E> My favorite is the $45000 samsung tv... so funny!!",
        "ts": "1474495067.000186"
    },
    {
        "type": "message",
        "user": "U1NUU2U9E",
        "text": "i made a mistake of starting reading them in the middle of the class... i had to stop in order not to burst out laughing",
        "ts": "1474495176.000187"
    },
    {
        "type": "message",
        "user": "U1NUU2U9E",
        "text": "<@U1L1D4WG7>",
        "ts": "1474495180.000188"
    },
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "I can't believe this isn't featured: <https:\/\/www.amazon.com\/ss\/customer-reviews\/B008JELLCA>",
        "ts": "1474495222.000189"
    },
    {
        "type": "message",
        "user": "U1KQYG6SJ",
        "text": "my all-time favorite",
        "edited": {
            "user": "U1KQYG6SJ",
            "ts": "1474495961.000000"
        },
        "ts": "1474495236.000190",
        "reactions": [
            {
                "name": "scream_cat",
                "users": [
                    "U1KRZT11T"
                ],
                "count": 1
            },
            {
                "name": "joy",
                "users": [
                    "U1KT9ATA5",
                    "U1MDHNYR5"
                ],
                "count": 2
            }
        ]
    }
]